In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
dates = pd.date_range('20180101', periods=6)

In [3]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), columns=list('ABCD'), index=dates)

In [5]:
df

                   A         B         C         D
2018-01-01 -0.225591  0.895653 -0.081544  0.515167
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-03  1.064915  2.294558 -0.451270 -0.348636
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-06  0.736548 -1.149403  1.041157 -0.134826

In [25]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20171225'),
                   'C':pd.Series(5, index=list(range(4)), dtype='float32'),
                   'D':np.array([3]*4),
                   'E':list('KLMN')})

In [26]:
df2

     A          B    C  D  E
0  1.0 2017-12-25  5.0  3  K
1  1.0 2017-12-25  5.0  3  L
2  1.0 2017-12-25  5.0  3  M
3  1.0 2017-12-25  5.0  3  N

In [27]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int64
E            object
dtype: object

In [32]:
df3 = pd.DataFrame({'A':1,
                   'B':pd.Timestamp('20171120'),
                   'C':pd.Series(5, index=list(range(4))),
                   'D':np.array([5]*4)})

In [33]:
df3

   A          B  C  D
0  1 2017-11-20  5  5
1  1 2017-11-20  5  5
2  1 2017-11-20  5  5
3  1 2017-11-20  5  5

In [34]:
df.head()

                   A         B         C         D
2018-01-01 -0.225591  0.895653 -0.081544  0.515167
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-03  1.064915  2.294558 -0.451270 -0.348636
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-05  0.316014  0.086821 -0.770988 -0.431766

In [35]:
df.tail(3)

                   A         B         C         D
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-06  0.736548 -1.149403  1.041157 -0.134826

In [36]:
df.index

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [37]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [38]:
df.values

array([[-0.22559104,  0.89565293, -0.08154376,  0.51516721],
       [ 0.33127474, -0.25298643, -0.48815356, -0.42554075],
       [ 1.06491515,  2.29455763, -0.45127021, -0.34863566],
       [-0.48469503,  0.54046032, -0.67156835,  0.82553427],
       [ 0.31601353,  0.08682124, -0.77098809, -0.43176619],
       [ 0.73654815, -1.14940254,  1.04115683, -0.13482569]])

In [39]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.289744  0.402517 -0.237061 -0.000011
std    0.577627  1.164460  0.669453  0.539284
min   -0.484695 -1.149403 -0.770988 -0.431766
25%   -0.090190 -0.168035 -0.625715 -0.406314
50%    0.323644  0.313641 -0.469712 -0.241731
75%    0.635230  0.806855 -0.173975  0.352669
max    1.064915  2.294558  1.041157  0.825534

In [40]:
df.T

   2018-01-01  2018-01-02  2018-01-03  2018-01-04  2018-01-05  2018-01-06
A   -0.225591    0.331275    1.064915   -0.484695    0.316014    0.736548
B    0.895653   -0.252986    2.294558    0.540460    0.086821   -1.149403
C   -0.081544   -0.488154   -0.451270   -0.671568   -0.770988    1.041157
D    0.515167   -0.425541   -0.348636    0.825534   -0.431766   -0.134826

In [41]:
df

                   A         B         C         D
2018-01-01 -0.225591  0.895653 -0.081544  0.515167
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-03  1.064915  2.294558 -0.451270 -0.348636
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-06  0.736548 -1.149403  1.041157 -0.134826

In [43]:
df.sort_index(ascending=False)

                   A         B         C         D
2018-01-06  0.736548 -1.149403  1.041157 -0.134826
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-03  1.064915  2.294558 -0.451270 -0.348636
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-01 -0.225591  0.895653 -0.081544  0.515167

In [48]:
df.sort_values(by='B')

                   A         B         C         D
2018-01-06  0.736548 -1.149403  1.041157 -0.134826
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-01 -0.225591  0.895653 -0.081544  0.515167
2018-01-03  1.064915  2.294558 -0.451270 -0.348636

In [49]:
df['A']

2018-01-01   -0.225591
2018-01-02    0.331275
2018-01-03    1.064915
2018-01-04   -0.484695
2018-01-05    0.316014
2018-01-06    0.736548
Freq: D, Name: A, dtype: float64

In [50]:
df.A

2018-01-01   -0.225591
2018-01-02    0.331275
2018-01-03    1.064915
2018-01-04   -0.484695
2018-01-05    0.316014
2018-01-06    0.736548
Freq: D, Name: A, dtype: float64

In [56]:
df[['A','B']]

                   A         B
2018-01-01 -0.225591  0.895653
2018-01-02  0.331275 -0.252986
2018-01-03  1.064915  2.294558
2018-01-04 -0.484695  0.540460
2018-01-05  0.316014  0.086821
2018-01-06  0.736548 -1.149403

In [67]:
df[0:1]

                   A         B         C         D
2018-01-01 -0.225591  0.895653 -0.081544  0.515167

In [70]:
df.loc[:,['A','B']]

                   A         B
2018-01-01 -0.225591  0.895653
2018-01-02  0.331275 -0.252986
2018-01-03  1.064915  2.294558
2018-01-04 -0.484695  0.540460
2018-01-05  0.316014  0.086821
2018-01-06  0.736548 -1.149403

In [81]:
df.loc['20180101':'20180105',['A','B','C']]

                   A         B         C
2018-01-01 -0.225591  0.895653 -0.081544
2018-01-02  0.331275 -0.252986 -0.488154
2018-01-03  1.064915  2.294558 -0.451270
2018-01-04 -0.484695  0.540460 -0.671568
2018-01-05  0.316014  0.086821 -0.770988

In [87]:
df.iloc[0:4, 0:2]

                   A         B
2018-01-01 -0.225591  0.895653
2018-01-02  0.331275 -0.252986
2018-01-03  1.064915  2.294558
2018-01-04 -0.484695  0.540460

In [90]:
df.iloc[0]

A   -0.225591
B    0.895653
C   -0.081544
D    0.515167
Name: 2018-01-01 00:00:00, dtype: float64

In [95]:
df.iloc[:,0]

2018-01-01   -0.225591
2018-01-02    0.331275
2018-01-03    1.064915
2018-01-04   -0.484695
2018-01-05    0.316014
2018-01-06    0.736548
Freq: D, Name: A, dtype: float64

In [96]:
df.iloc[0,:]

A   -0.225591
B    0.895653
C   -0.081544
D    0.515167
Name: 2018-01-01 00:00:00, dtype: float64

In [98]:
df.iloc[[1,2,4],[1,3]]

                   B         D
2018-01-02 -0.252986 -0.425541
2018-01-03  2.294558 -0.348636
2018-01-05  0.086821 -0.431766

In [99]:
df

                   A         B         C         D
2018-01-01 -0.225591  0.895653 -0.081544  0.515167
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-03  1.064915  2.294558 -0.451270 -0.348636
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-06  0.736548 -1.149403  1.041157 -0.134826

In [102]:
df.iloc[[1],[1]]

                   B
2018-01-02 -0.252986

In [103]:
df.iloc[1,1]

-0.252986427316842

In [104]:
df.iat[1,1]

-0.252986427316842

In [105]:
df['A']>0

2018-01-01    False
2018-01-02     True
2018-01-03     True
2018-01-04    False
2018-01-05     True
2018-01-06     True
Freq: D, Name: A, dtype: bool

In [110]:
df[df['A']>0]

                   A         B         C         D
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-03  1.064915  2.294558 -0.451270 -0.348636
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-06  0.736548 -1.149403  1.041157 -0.134826

In [111]:
df[df['A']>0].A

2018-01-02    0.331275
2018-01-03    1.064915
2018-01-05    0.316014
2018-01-06    0.736548
Name: A, dtype: float64

In [112]:
df[df>0]

                   A         B         C         D
2018-01-01       NaN  0.895653       NaN  0.515167
2018-01-02  0.331275       NaN       NaN       NaN
2018-01-03  1.064915  2.294558       NaN       NaN
2018-01-04       NaN  0.540460       NaN  0.825534
2018-01-05  0.316014  0.086821       NaN       NaN
2018-01-06  0.736548       NaN  1.041157       NaN

In [113]:
df_copy = df.copy()

In [114]:
df_copy

                   A         B         C         D
2018-01-01 -0.225591  0.895653 -0.081544  0.515167
2018-01-02  0.331275 -0.252986 -0.488154 -0.425541
2018-01-03  1.064915  2.294558 -0.451270 -0.348636
2018-01-04 -0.484695  0.540460 -0.671568  0.825534
2018-01-05  0.316014  0.086821 -0.770988 -0.431766
2018-01-06  0.736548 -1.149403  1.041157 -0.134826

In [116]:
df_copy = df_copy[df_copy>0]

In [117]:
df_copy

                   A         B         C         D
2018-01-01       NaN  0.895653       NaN  0.515167
2018-01-02  0.331275       NaN       NaN       NaN
2018-01-03  1.064915  2.294558       NaN       NaN
2018-01-04       NaN  0.540460       NaN  0.825534
2018-01-05  0.316014  0.086821       NaN       NaN
2018-01-06  0.736548       NaN  1.041157       NaN

In [118]:
df_copy.dropna()

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [119]:
df_copy

                   A         B         C         D
2018-01-01       NaN  0.895653       NaN  0.515167
2018-01-02  0.331275       NaN       NaN       NaN
2018-01-03  1.064915  2.294558       NaN       NaN
2018-01-04       NaN  0.540460       NaN  0.825534
2018-01-05  0.316014  0.086821       NaN       NaN
2018-01-06  0.736548       NaN  1.041157       NaN

In [120]:
df_copy.drop_duplicates()

                   A         B         C         D
2018-01-01       NaN  0.895653       NaN  0.515167
2018-01-02  0.331275       NaN       NaN       NaN
2018-01-03  1.064915  2.294558       NaN       NaN
2018-01-04       NaN  0.540460       NaN  0.825534
2018-01-05  0.316014  0.086821       NaN       NaN
2018-01-06  0.736548       NaN  1.041157       NaN

In [121]:
df_copy.fillna(method='ffill')

                   A         B         C         D
2018-01-01       NaN  0.895653       NaN  0.515167
2018-01-02  0.331275  0.895653       NaN  0.515167
2018-01-03  1.064915  2.294558       NaN  0.515167
2018-01-04  1.064915  0.540460       NaN  0.825534
2018-01-05  0.316014  0.086821       NaN  0.825534
2018-01-06  0.736548  0.086821  1.041157  0.825534

In [122]:
df_copy

                   A         B         C         D
2018-01-01       NaN  0.895653       NaN  0.515167
2018-01-02  0.331275       NaN       NaN       NaN
2018-01-03  1.064915  2.294558       NaN       NaN
2018-01-04       NaN  0.540460       NaN  0.825534
2018-01-05  0.316014  0.086821       NaN       NaN
2018-01-06  0.736548       NaN  1.041157       NaN

In [124]:
df_copy.fillna(0)

                   A         B         C         D
2018-01-01  0.000000  0.895653  0.000000  0.515167
2018-01-02  0.331275  0.000000  0.000000  0.000000
2018-01-03  1.064915  2.294558  0.000000  0.000000
2018-01-04  0.000000  0.540460  0.000000  0.825534
2018-01-05  0.316014  0.086821  0.000000  0.000000
2018-01-06  0.736548  0.000000  1.041157  0.000000

In [127]:
df_copy

                   A         B         C         D
2018-01-01       NaN  0.895653       NaN  0.515167
2018-01-02  0.331275       NaN       NaN       NaN
2018-01-03  1.064915  2.294558       NaN       NaN
2018-01-04       NaN  0.540460       NaN  0.825534
2018-01-05  0.316014  0.086821       NaN       NaN
2018-01-06  0.736548       NaN  1.041157       NaN

In [128]:
df_copy.fillna(method='backfill')

                   A         B         C         D
2018-01-01  0.331275  0.895653  1.041157  0.515167
2018-01-02  0.331275  2.294558  1.041157  0.825534
2018-01-03  1.064915  2.294558  1.041157  0.825534
2018-01-04  0.316014  0.540460  1.041157  0.825534
2018-01-05  0.316014  0.086821  1.041157       NaN
2018-01-06  0.736548       NaN  1.041157       NaN

In [131]:
df_copy.loc[0:,'D'] = np.array([5] *len(df_copy))

In [132]:
df_copy

                   A         B         C    D
2018-01-01       NaN  0.895653       NaN  5.0
2018-01-02  0.331275       NaN       NaN  5.0
2018-01-03  1.064915  2.294558       NaN  5.0
2018-01-04       NaN  0.540460       NaN  5.0
2018-01-05  0.316014  0.086821       NaN  5.0
2018-01-06  0.736548       NaN  1.041157  5.0

In [137]:
df_copy.loc[0:,'D'] = np.array([5] *len(df_copy), dtype=int) #?why int not working

In [138]:
df_copy

                   A         B         C    D
2018-01-01       NaN  0.895653       NaN  5.0
2018-01-02  0.331275       NaN       NaN  5.0
2018-01-03  1.064915  2.294558       NaN  5.0
2018-01-04       NaN  0.540460       NaN  5.0
2018-01-05  0.316014  0.086821       NaN  5.0
2018-01-06  0.736548       NaN  1.041157  5.0

In [140]:
df_copy.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [141]:
df_copy[df_copy>0] = -df_copy

In [142]:
df_copy

                   A         B         C    D
2018-01-01       NaN -0.895653       NaN -5.0
2018-01-02 -0.331275       NaN       NaN -5.0
2018-01-03 -1.064915 -2.294558       NaN -5.0
2018-01-04       NaN -0.540460       NaN -5.0
2018-01-05 -0.316014 -0.086821       NaN -5.0
2018-01-06 -0.736548       NaN -1.041157 -5.0

In [143]:
df_copy = df_copy.fillna(0)

In [144]:
df_copy

                   A         B         C    D
2018-01-01  0.000000 -0.895653  0.000000 -5.0
2018-01-02 -0.331275  0.000000  0.000000 -5.0
2018-01-03 -1.064915 -2.294558  0.000000 -5.0
2018-01-04  0.000000 -0.540460  0.000000 -5.0
2018-01-05 -0.316014 -0.086821  0.000000 -5.0
2018-01-06 -0.736548  0.000000 -1.041157 -5.0